app/controllers/api/v1/greetings_controller.rb

  def index
    @greetings = Greeting.all
---
SELECT "greetings".* FROM "greetings"